app/controllers/bears_controller.rb

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def show
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @bear = Bear.new(whitelisted_bear_params)
    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bear through form"], ["description", "RAAAAAAAWR"], ["created_at", "2016-02-01 16:21:25.541990"], ["updated_at", "2016-02-01 16:21:25.541990"]]

  def edit
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @bear = Bear.find(params[:id])
    if @bear.update(whitelisted_bear_params)
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "bears" SET "description" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["description", "A hilarious bear that has been updated"], ["updated_at", "2016-02-01 16:17:05.773654"], ["id", 1]]

  def destroy
    @bear = Bear.find(params[:id])
    if @bear.destroy
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 4]]